{
  "projectList": [
    {
      "title": "Bubble League",
      "group": "Triangle Interactive Arts Council - Global Game Jam 2025",
      "timespan": "Jan 2025",
      "link": "https://armandpreschutti.itch.io/bubble-league",
      "description" : "A local coop game answering the question: What if Rocket League was a 2D game with penguins instead of cars? Collaborated with members of the Triangle Interactive Arts Council to develop Bubble League for the Global Game Jam 2025. Worked on much of the core physics and player controls. In just a few days, we developed a solid fun little game.",
      "skills": ["Collaboration", "Unity Game Engine", "C#", "Rider"],
      "image": "/bubble_league.png"
    },
    {
      "title": "GLEngine",
      "group": "Sole Developer",
      "timespan": "Nov 2024 - present",
      "link": "https://github.com/JamesWIToll/GLEngine",
      "description" : "A simple 3D rendering engine that documents my early progress learning the OpenGL 4.6 API. It includes 3D rendering of primitives such as cubes and spheres with textures, simple phong lighting, programmatic UV- and Ico-sphere vertex and texture coordinate generation, and a look-around camera.",
      "skills": ["C++", "OpenGL", "GLSL", "SFML", "Clion", "Cmake", "Linear Algebra"],
      "image": "/glengine.png"
    },
    {
      "title": "This Website",
      "group": "Sole Developer",
      "timespan": "Spring 2025 - present",
      "link": "https://github.com/JamesWIToll/JamesWIToll.github.io",
      "description" : "This website shows off both my experience with web development as well as my progress learning graphics programming using the WebGL 2.0 graphics API. The 3D viewer on this site uses various techniques to create both realistic and stylized images from 3D models.",
      "skills": ["JS", "WebGL 2.0", "GLSL", "Vue JS", "HTML", "CSS", "WebStorm"],
      "image": "/this_site.png"
    },
    {
      "title": "TestFantasyGame",
      "group": "Sole Developer",
      "timespan": "July 2024",
      "link": "https://github.com/JamesWIToll/MonoGame_TestFantasyGame",
      "description": "A simple 2D tech demo using the MonoGame framework. It includes a basic perlin noise world generation algorithm with a tiled world-map, basic character movement, and simple combat with Orc enemies that follow the player.",
      "skills": ["C#", "MonoGame", "VS Code"],
      "image": "/testfantasygame.png"
    }

  ]
}